from math import factorial

""""
Задание 1.
Из колоды в 52 карты извлекаются случайным образом 4 карты.
a) Найти вероятность того, что все карты – крести.
б) Найти вероятность, что среди 4-х карт окажется хотя бы один туз.
"""

def cards(n, m, k):
    return 1 - ((int(factorial(k)/ (factorial(m) * factorial(k-m))))/(int(factorial(n) / (factorial(m) * factorial(n - m)))))
print("Задание 1:", cards(52, 4, 48))

""""
Задание 2
На входной двери подъезда установлен кодовый замок, содержащий десять кнопок с цифрами от 0 до 9. 
Код содержит три цифры, которые нужно нажать одновременно. 
Какова вероятность того, что человек, не знающий код, откроет дверь с первой попытки?
"""

def lock (n, m):
    return 1/(factorial(n)/((factorial(m) * factorial(n - m))))
print("Задание 2:", lock(10, 3))

""""
Задание 3
В ящике имеется 15 деталей, из которых 9 окрашены.
Рабочий случайным образом извлекает 3 детали. 
Какова вероятность того, что все извлеченные детали окрашены?
"""

print("Задание 3:", 9/15 * 8/14 * 7/13)

"""
Задание 4
В лотерее 100 билетов. Из них 2 выигрышных. 
Какова вероятность того, что 2 приобретенных билета окажутся выигрышными?
"""

def ticket (n, m, k, z, r):
    return ((factorial(n)/((factorial(m) * factorial(n - m)))) * (factorial(k)/((factorial(z) * factorial(k - z))))) / (factorial(r)/((factorial(m) * factorial(r - m))))
print("Задание 4:", ticket(2, 2, 98, 0, 100))